import ParagraphArticle from "../components/Article/ParagraphArticle/ParagraphArticle"
import SubtitleArticle from "../components/Article/SubtitleArticle/SubtitleArticle"
import TitleArticle from "../components/Article/TitleArticle.tsx/TitleArticle"
import Footer from "../components/Footer/Footer"
import Navbar from "../components/Navbar/Navbar"

const Policy = () => {
   return (
      <div className="relative">
         <div className='absolute top-0 left-0 -z-10 max-sm:hidden'>
            <img src="/images/lecturesBg1.png" alt="Glow" />
         </div>
         <div className='absolute bottom-0 right-0 -z-10 max-sm:bottom-28'>
            <img src="/images/lecturesBg2.png" alt="Glow" />
         </div>
         <Navbar />
         <div className="container py-24 max-sm:py-12">
            <TitleArticle>
               Політика конфіденційності
            </TitleArticle>
            <ParagraphArticle>
               Персональні дані Користувача / Покупця обробляються відповідно до Закону України від 01 червня 2010 р. No 2297-VI «Про захист персональних даних». Термін зберігання особистих даних становить 5 років.
            </ParagraphArticle>
            <ParagraphArticle>
               Власник має право надсилати інформацію, включаючи рекламні повідомлення, на електронну пошту та мобільний телефон Користувача / Покупця за його згодою. Користувач / Покупець має право відмовитися отримувати рекламу та іншу інформацію, не вказуючи причин для відмови. Повідомлення Сервісу про замовлення та етапи його обробки, не можуть бути відхилені Користувачем / Покупцем.            </ParagraphArticle>
            <ParagraphArticle>
               Власник не несе відповідальності за інформацію, надану Користувачем / Покупцем на Сайті в загально доступній формі.
            </ParagraphArticle>
            <ParagraphArticle>
               Власник має право записувати телефонні розмови з Користувачем / Покупцем. Таким чином Власник зобов’язується: запобігати спробам несанкціонованого доступу до інформації, отриманої в ході телефонних розмов, та / або передавати її третім особам, не пов’язаним безпосередньо з виконанням замовлень.
            </ParagraphArticle>
            <ParagraphArticle>
               Заповнюючи будь-яку форму на сайті ви погоджуєтеся з політикою конфіденційності та з тим, що ми можемо розголошувати ваші особисті дані в наступних випадках:
            </ParagraphArticle>
            <SubtitleArticle>
               Компаніям, працюючим від нашої особи
            </SubtitleArticle>
            <ParagraphArticle>
               Ми співпрацюємо з компаніями, які виконують від нашого особи функції бізнес-підтримки. Наприклад: виконання замовлень, реалізація заявок, видача призів і бонусів, проведення опитувань серед клієнтів і управління інформаційними системами. Тому ваша особиста інформація може бути частково розкрита.Але переживати не варто — ми завжди укладаємо договори з такими компаніями і вимагаємо, щоб вони використовували вашу контактну інформацію тільки в рамках обумовлених послуг.
            </ParagraphArticle>
            <SubtitleArticle>
               При передачі контролю над компанією
            </SubtitleArticle>
            <ParagraphArticle>
               У разі повного або часткового продажу компанії або її активів ми також можемо передати новій організації вашу персональну інформацію. Але перед цим — в обов’язковому порядку повідомимо вас, і надамо можливість відмовитися від розсилки.Іноді це означає, що нова організація не зможе надавати вам доступ до нових продуктів або матеріалів, до яких ви раніше проявляли інтерес, будучи нашим передплатником.
            </ParagraphArticle>
            <SubtitleArticle>
               Іншим компаніям при реалізації спільних проектів
            </SubtitleArticle>
            <ParagraphArticle>
               Коли ми зберемося реалізовувати проект / конкурс / подія з іншою компанією — попросимо дозвіл на спільне використання вашої особистої інформації. Поки не отримаємо явного згоди — дані третій особі передаватися не будуть.
            </ParagraphArticle>
            <SubtitleArticle>
               Правоохоронним органам
            </SubtitleArticle>
            <ParagraphArticle>
               Ми можемо без вашої згоди розкривати персональну інформацію третім сторонам по кожній із наступних причин: щоб уникнути порушень закону, нормативних правових актів або постанов суду; участь в урядових розслідуваннях; допомога в запобіганні шахрайства; зміцнення або захист прав компанії або її дочірніх підприємств. Щоб змінити або видалити особисту інформацію з нашої бази — напишіть на support@shopifygrowthstudio.com.
            </ParagraphArticle>
         </div>
         <Footer />
      </div>
   )
}

export default Policy